// Задача 6: Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).
Console.WriteLine("Please enter number: ");
int Number=Convert.ToInt32(Console.ReadLine());

if ((Number % 2) == 0) 
  {Console.WriteLine("The number is even");}
else
    {
              {Console.WriteLine("The number is not even");}
        }
  